lains/stm32-linky-display/src/main.cpp
        pos++;

        unsigned int framesCount = ticParser.nbFramesParsed;
        statusLine[pos++]=(framesCount / 1000) % 10 + '0';
        statusLine[pos++]=(framesCount / 100) % 10 + '0';
        statusLine[pos++]=(framesCount / 10) % 10 + '0';
        statusLine[pos++]=(framesCount / 1) % 10 + '0';
        pos++; // 'F'

        pos++;

        unsigned long rxBytesCount = ticSerial.getRxBytesTotal();
        statusLine[pos++]=(rxBytesCount / 10000000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1000000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 100000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 10000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1000) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 100) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 10) % 10 + '0';
        statusLine[pos++]=(rxBytesCount / 1) % 10 + '0';
        pos++; // 'B'

        pos++;

        unsigned int serialRxOverflowCount = ticContext.serialRxOverflowCount;
        statusLine[pos++]=(serialRxOverflowCount / 10) % 10 + '0';
        statusLine[pos++]=(serialRxOverflowCount / 1) % 10 + '0';
        pos++; // 'X'

        pos++;

        unsigned int nbSamples = 1;
        PowerHistoryEntry lastMeasurement;
        powerHistory.getLastPower(nbSamples, &lastMeasurement);
        if (nbSamples == 1 && lastMeasurement.horodate.isValid) {   /* We have a valid last measurement */
            const TIC::Horodate& displayedHorodate = lastMeasurement.horodate;
            unsigned int horodateHour = displayedHorodate.hour;
            statusLine[pos++]=(horodateHour / 10) % 10 + '0';
            statusLine[pos++]=(horodateHour / 1) % 10 + '0';
            pos++;
            unsigned int horodateMinute = displayedHorodate.minute;
            statusLine[pos++]=(horodateMinute / 10) % 10 + '0';
            statusLine[pos++]=(horodateMinute / 1) % 10 + '0';
            pos++;
            unsigned int horodateSecond = displayedHorodate.second;
            statusLine[pos++]=(horodateSecond / 10) % 10 + '0';
            statusLine[pos++]=(horodateSecond / 1) % 10 + '0';
            pos++;
        }
        else {
            pos += 9;
        }

        BSP_LCD_SetFont(&Font24);
        lcd.fillRect(0, 3*24, lcd.getWidth(), 24, Stm32LcdDriver::LCD_Color::Black);
        BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
        BSP_LCD_SetBackColor(LCD_COLOR_BLACK);
        auto get_font24_ptr = [](const char c) {
            unsigned int bytesPerGlyph = Font24.Height * ((Font24.Width + 7) / 8);
            return &(Font24.table[(c-' ') * bytesPerGlyph]);
        };
        
        lcd.drawText(0, 3*24, statusLine, Font24.Width, Font24.Height, get_font24_ptr, Stm32LcdDriver::LCD_Color::White, Stm32LcdDriver::LCD_Color::Black);

        lcd.fillRect(0, 4*24, lcd.getWidth(), lcd.getHeight() - 4*24, Stm32LcdDriver::LCD_Color::White);
        if (nbSamples == 1 && lastMeasurement.power.isValid) {   /* We have a valid last measurement */
            char mainInstPowerText[] = "-[9999;9999]W";
            const TicEvaluatedPower& instantaneousPower = lastMeasurement.power;
            if (instantaneousPower.isExact && instantaneousPower.minValue>0) {  /* We are withdrawing power */
                unsigned int withdrawnPower = static_cast<unsigned int>(instantaneousPower.minValue);
                if (withdrawnPower <= 9999) {
                    for (unsigned int pos=0; pos<8; pos++)
                        mainInstPowerText[pos] = ' ';   /* Fill leading characters with blank */
                    
                    if (withdrawnPower < 1000) {
                        mainInstPowerText[8]=' ';
                    } else {
                        uint8_t digit1000 = (withdrawnPower / 1000) % 10;
                        mainInstPowerText[8]=digit1000 + '0';
                    }
                    if (withdrawnPower < 100) {
                        mainInstPowerText[9]=' ';
                    } else {
                        uint8_t digit100 = (withdrawnPower / 100) % 10;
                        mainInstPowerText[9]=digit100 + '0';
                    }
                    if (withdrawnPower < 10) {
                        mainInstPowerText[10]=' ';
                    } else {
                        uint8_t digit10 = (withdrawnPower / 10) % 10;
                        mainInstPowerText[10]=digit10  + '0';
                    }
                    {
                        uint8_t digit1 = (withdrawnPower / 1) % 10;
                        mainInstPowerText[11]=digit1 + '0';
                    }
                    mainInstPowerText[12]='W';
                }
                else {
                    for (unsigned int pos=0; pos<sizeof(mainInstPowerText)-1; pos++)
                        mainInstPowerText[pos] = '?';   /* Fill all characters with blank */
                }
            }
            else { /* We are injecting power */
                if (instantaneousPower.isValid) {
                    unsigned int minPower = -(instantaneousPower.minValue); /* min and max will be negative */
                    unsigned int maxPower = -(instantaneousPower.maxValue);
                    mainInstPowerText[0]='-';
                    mainInstPowerText[1]='[';
                    if (minPower < 1000) {
                        mainInstPowerText[2]=' ';
                    } else {
                        uint8_t digit1000 = (minPower / 1000) % 10;
                        mainInstPowerText[2]=digit1000 + '0';
                    }
                    if (minPower < 100) {
                        mainInstPowerText[3]=' ';
                    } else {
                        uint8_t digit100 = (minPower / 100) % 10;
                        mainInstPowerText[3]=digit100 + '0';
                    }
                    if (minPower < 10) {
                        mainInstPowerText[4]=' ';
                    } else {
                        uint8_t digit10 = (minPower / 10) % 10;
                        mainInstPowerText[4]=digit10  + '0';
                    }
                    {
                        uint8_t digit1 = (minPower / 1) % 10;
                        mainInstPowerText[5]=digit1 + '0';
                    }
                    mainInstPowerText[6]=';';

                    if (maxPower < 1000) {
                        mainInstPowerText[7]=' ';
                    } else {
                        uint8_t digit1000 = (maxPower / 1000) % 10;
                        mainInstPowerText[7]=digit1000 + '0';
                    }
                    if (maxPower < 100) {
                        mainInstPowerText[8]=' ';
                    } else {
                        uint8_t digit100 = (maxPower / 100) % 10;
                        mainInstPowerText[8]=digit100 + '0';
                    }
                    if (maxPower < 10) {
                        mainInstPowerText[9]=' ';
                    } else {
                        uint8_t digit10 = (maxPower / 10) % 10;
                        mainInstPowerText[9]=digit10  + '0';
                    }
                    {
                        uint8_t digit1 = (maxPower / 1) % 10;
                        mainInstPowerText[10]=digit1 + '0';
                    }
                    mainInstPowerText[11]=']';
                    mainInstPowerText[12]='W';
                }
            }
            lcd.drawText(0, lcd.getHeight()/2 - 120, mainInstPowerText, 60, 120, get_font58_ptr, Stm32LcdDriver::LCD_Color::Blue, Stm32LcdDriver::LCD_Color::White);
            //drawHistory(lcd, 0, lcd.getHeight()/2 + 120, lcd.getWidth(), lcd.getHeight(), powerHistory);
        }
        drawHistory(lcd, 0, lcd.getHeight()/2, lcd.getWidth(), lcd.getHeight() - lcd.getHeight()/2 - 1, powerHistory);

        //BSP_LED_On(LED1);
        //waitDelay(250, streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)););
        //BSP_LED_Off(LED1);

        lcd.displayDraft(streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* While waiting, continue forwarding incoming TIC bytes to the unframer */

        lcd.copyDraftToFinal();

        lcd.requestDisplayFinal(); /* Now we have copied the content to display to final framebuffer, we can perform the switch */

        waitDelay(1000, streamTicRxBytesToUnframer, static_cast<void*>(&ticContext)); /* While waiting, continue forwarding incoming TIC bytes to the unframer */
        lcdRefreshCount++;
    }
}

